spec/vcr_cassettes/donation_push_paypal.yml

---
http_interactions:
- request:
    method: post
    uri: https://<AK_USERNAME>:<AK_PASSWORD>@act.sumofus.org/rest/v1/donationpush/
    body:
      encoding: UTF-8
      string: '{"donationpage":{"name":"foo-bar-donation","payment_account":"PayPal
        EUR"},"order":{"amount":"34.00","card_code":"007","card_num":"4111111111111111","exp_date_month":"12","exp_date_year":"2015","currency":"GBP"},"user":{"email":"foo+100@example.com","country":"Portugal"}}'
    headers:
      Content-Type:
      - application/json
      Charset:
      - UTF-8
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Date:
      - Fri, 12 Feb 2016 18:30:50 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Machine-Id:
      - web-g02-01.actionkit.com
      Vary:
      - Accept,Cookie,Accept-Encoding,User-Agent
      Location:
      - https://act.sumofus.org/rest/v1/donationaction/61094280/
      Set-Cookie:
      - sid=cp6kaq8mhtznx9yav9nxzarht4xi27ow; expires=Sat, 13-Feb-2016 02:17:53 GMT;
        httponly; Max-Age=28800; Path=/
    body:
      encoding: UTF-8
      string: '{"akid": ".10555390.Bl7ItH", "created_at": "2016-02-12T18:17:53.862636",
        "created_user": false, "fields": {}, "id": 61094280, "ip_address": "2.102.91.21",
        "is_forwarded": false, "link": null, "mailing": null, "opq_id": "", "order":
        {"account": "PayPal EUR", "action": "/rest/v1/donationaction/61094280/", "card_num_last_four":
        "1111", "created_at": "2016-02-12T18:17:53.923631", "currency": "GBP", "id":
        804585, "import_id": null, "orderdetails": [], "orderrecurrings": [], "payment_method":
        "cc", "resource_uri": "/rest/v1/order/804585/", "shipping_address": null,
        "status": "completed", "total": "34.00", "total_converted": "49.2246380113",
        "transactions": ["/rest/v1/transaction/959446/"], "updated_at": "2016-02-12T18:17:53.938307",
        "user": "/rest/v1/user/10555390/", "user_detail": "/rest/v1/orderuserdetail/804710/"},
        "page": "/rest/v1/donationpage/8644/", "referring_mailing": null, "referring_user":
        null, "resource_uri": "/rest/v1/donationaction/61094280/", "source": "restful_api",
        "status": "complete", "subscribed_user": false, "taf_emails_sent": null, "type":
        "Donation", "updated_at": "2016-02-12T18:17:53.906822", "user": "/rest/v1/user/10555390/"}'
    http_version: 
  recorded_at: Fri, 12 Feb 2016 18:17:54 GMT
recorded_with: VCR 3.0.1
